In [70]:
import pandas as pd
df=pd.read_csv("income1.csv")
d=df.copy()
df

,GEOID,State,2005,2006,2007,2008,2009,2010,2011,2012,2013
0,04000US01,Alabama,37150,37952,42212,44476,39980,40933,42590,43464,41381
1,04000US02,Alaska,55891,56418,62993,63989,61604,57848,57431,63648,61137
2,04000US04,Arizona,45245,46657,62993,46914,45739,46896,48621,47044,50602
3,04000US05,Arkansas,36658,37057,40795,39586,36538,38587,41302,39018,39919
4,04000US06,California,51755,55319,55734,57014,56134,54283,53367,57020,57528

In [2]:
df.columns

Index(['GEOID', 'State', '2005', '2006', '2007', '2008', '2009', '2010',
       '2011', '2012', '2013'],
      dtype='object')

In [3]:
df["2010"]

0    40933
1    57848
2    46896
3    38587
4    54283
Name: 2010, dtype: int64

In [4]:
s=0
for i in df["2010"]:
    s=s+i
print(s)

238547

In [10]:
s=0
c=1
for i in df["2010"]:
    a=s/c
    
print(a)

0.0

In [7]:
#find the sum of a row
df.iloc[1,2:]

2005    55891
2006    56418
2007    62993
2008    63989
2009    61604
2010    57848
2011    57431
2012    63648
2013    61137
Name: 1, dtype: object

In [9]:
s=0
for i in df.iloc[1,2:]:
    s=s+i
print(i)

61137

In [11]:
df["2010"].sum()

238547

In [12]:
df

,GEOID,State,2005,2006,2007,2008,2009,2010,2011,2012,2013
0,04000US01,Alabama,37150,37952,42212,44476,39980,40933,42590,43464,41381
1,04000US02,Alaska,55891,56418,62993,63989,61604,57848,57431,63648,61137
2,04000US04,Arizona,45245,46657,62993,46914,45739,46896,48621,47044,50602
3,04000US05,Arkansas,36658,37057,40795,39586,36538,38587,41302,39018,39919
4,04000US06,California,51755,55319,55734,57014,56134,54283,53367,57020,57528

In [21]:
#4th row and all colums sum
s=0
for i in df.iloc[4,2:]:
    s=s+i
print(s)

498154

In [22]:
df.iloc[4,2:].sum()

498154

In [23]:
# sum of 2005 to 2008 colums
df.iloc[:,2:6].sum()

2005    226699
2006    233403
2007    264727
2008    251979
dtype: int64

In [25]:
a=df.iloc[:,2:6].sum()
a.sum()

976808

In [24]:
a=df[["2005","2006","2007","2008"]].sum()
a.sum()

976808

In [28]:
#sum values in all columns
a=df.iloc[:,2:].sum()
a.sum()

2199422

In [29]:
#to find the total sum of a individual columns
df.sum()

GEOID    04000US0104000US0204000US0404000US0504000US06
State           AlabamaAlaskaArizonaArkansasCalifornia
2005                                            226699
2006                                            233403
2007                                            264727
2008                                            251979
2009                                            239995
2010                                            238547
2011                                            243311
2012                                            250194
2013                                            250567
dtype: object

In [30]:
# to find the total sum of the individual rows
df.sum(1)

0    370138
1    540959
2    440711
3    349460
4    498154
dtype: int64

## prod()

In [31]:
df.prod()

2005    2304332586102593708
2006   -3396487475510719616
2007   -6999381839592754296
2008   -6111060772352250592
2009    6209617939067354560
2010    1185894860788790400
2011    4814774946528885700
2012    1466460077803167744
2013    3670165461116089616
dtype: int64

In [32]:
df

,GEOID,State,2005,2006,2007,2008,2009,2010,2011,2012,2013
0,04000US01,Alabama,37150,37952,42212,44476,39980,40933,42590,43464,41381
1,04000US02,Alaska,55891,56418,62993,63989,61604,57848,57431,63648,61137
2,04000US04,Arizona,45245,46657,62993,46914,45739,46896,48621,47044,50602
3,04000US05,Arkansas,36658,37057,40795,39586,36538,38587,41302,39018,39919
4,04000US06,California,51755,55319,55734,57014,56134,54283,53367,57020,57528

In [ ]:
df

In [35]:
df.iloc[1:2,2:6].prod()

2005    55891
2006    56418
2007    62993
2008    63989
dtype: int64

In [48]:
x=df.iloc[1:2,2:5].prod()
x.prod()

198633208784934

## mean()

In [40]:
 to find the average
# find the avg of 2011 colum
df["2011"].mean()

48662.2

In [45]:
# finding the avg of second row
df.iloc[2,2:].mean()

48967.88888888889

## median()

In [46]:

#find the median of 2011 column
df["2011"].median()

48621.0

In [47]:
#find the median of second row
df.iloc[2,2:].median()

46914.0

In [49]:
df

,GEOID,State,2005,2006,2007,2008,2009,2010,2011,2012,2013
0,04000US01,Alabama,37150,37952,42212,44476,39980,40933,42590,43464,41381
1,04000US02,Alaska,55891,56418,62993,63989,61604,57848,57431,63648,61137
2,04000US04,Arizona,45245,46657,62993,46914,45739,46896,48621,47044,50602
3,04000US05,Arkansas,36658,37057,40795,39586,36538,38587,41302,39018,39919
4,04000US06,California,51755,55319,55734,57014,56134,54283,53367,57020,57528

## Combined Average Income of all states from 2005 to 2013

In [86]:
d.iloc[0:,2:].mean()#column wise avg

2006    46680.6
2007    52945.4
2008    50395.8
2009    47999.0
2010    47709.4
2011    48662.2
2012    50038.8
2013    50113.4
dtype: float64

In [85]:
d.iloc[0:,2:].mean(1) # row  wise avg

0    41126.444444
1    60106.555556
2    48967.888889
3    38828.888889
4    55350.444444
dtype: float64

In [90]:
d.iloc[0:,2:].mean(1).mean()#combined avg

49318.075

## State with highest average income in the last three years

In [93]:
import pandas as pd
#d.index=d["State"]
d=pd.read_csv("income1.csv",index_col="State")
d.head(3)
d

,GEOID,2005,2006,2007,2008,2009,2010,2011,2012,2013
State,,,,,,,,,,
Alabama,04000US01,37150,37952,42212,44476,39980,40933,42590,43464,41381
Alaska,04000US02,55891,56418,62993,63989,61604,57848,57431,63648,61137
Arizona,04000US04,45245,46657,62993,46914,45739,46896,48621,47044,50602
Arkansas,04000US05,36658,37057,40795,39586,36538,38587,41302,39018,39919
California,04000US06,51755,55319,55734,57014,56134,54283,53367,57020,57528

In [91]:
d.iloc[:,-3:]

             2011   2012   2013
State
Alabama     42590  43464  41381
Alaska      57431  63648  61137
Arizona     48621  47044  50602
Arkansas    41302  39018  39919
California  53367  57020  57528

In [92]:
d.iloc[:,-3:].mean(1) # row wise avg oif last 3 years

State
Alabama       42478.333333
Alaska        60738.666667
Arizona       48755.666667
Arkansas      40079.666667
California    55971.666667
dtype: float64

In [78]:
a=d.iloc[:,7:].mean(1).idxmax()
a

'Alaska'

In [82]:
d["2011"]==max(d["2011"])

State
Alabama       False
Alaska         True
Arizona       False
Arkansas      False
California    False
Name: 2011, dtype: bool

In [97]:
d["last three years avg"]=d.iloc[:,-3:].mean(1)

In [98]:
d

,GEOID,2005,2006,2007,2008,2009,2010,2011,2012,2013,last three years avg
State,,,,,,,,,,,
Alabama,04000US01,37150,37952,42212,44476,39980,40933,42590,43464,41381,42478.333333
Alaska,04000US02,55891,56418,62993,63989,61604,57848,57431,63648,61137,60738.666667
Arizona,04000US04,45245,46657,62993,46914,45739,46896,48621,47044,50602,48755.666667
Arkansas,04000US05,36658,37057,40795,39586,36538,38587,41302,39018,39919,40079.666667
California,04000US06,51755,55319,55734,57014,56134,54283,53367,57020,57528,55971.666667

In [100]:
d[d["last three years avg"]==max(d["last three years avg"])].index[0]

'Alaska'

## State with lowest average income from 2007 to 2010(inclusive)

In [104]:
a=d.iloc[:,4:8]
a

             2008   2009   2010   2011
State
Alabama     44476  39980  40933  42590
Alaska      63989  61604  57848  57431
Arizona     46914  45739  46896  48621
Arkansas    39586  36538  38587  41302
California  57014  56134  54283  53367

In [105]:
a=d.iloc[:,4:8].mean(1).idxmin()
a

'Arkansas'

## Print the list of all states in the same line with average income less than California

In [114]:
a=d.iloc[:,2:].mean(1)
a

State
Alabama       41718.481481
Alaska        60645.185185
Arizona       49357.962963
Arkansas      39209.074074
California    55818.962963
dtype: float64

In [113]:
cal=d.iloc[-1,2:].mean()
cal

55818.96296296296

In [117]:
a=d.iloc[:,2:].mean(1)<cal
a

State
Alabama        True
Alaska        False
Arizona        True
Arkansas       True
California    False
dtype: bool

In [118]:
list(d[d.iloc[:,2:].mean(1)<cal].index)

['Alabama', 'Arizona', 'Arkansas']

## Print the names of states based on descending order of income in the year 2009

In [125]:
a=d.iloc[:,6]
a

State
Alabama       40933
Alaska        57848
Arizona       46896
Arkansas      38587
California    54283
Name: 2010, dtype: int64

In [126]:
b=a.sort_values(ascending=False)
b

State
Alaska        57848
California    54283
Arizona       46896
Alabama       40933
Arkansas      38587
Name: 2010, dtype: int64

In [127]:
list(b.index)

['Alaska', 'California', 'Arizona', 'Alabama', 'Arkansas']

## State with the lowest recorded income from 2005 to 2013'''

In [128]:
d

,GEOID,2005,2006,2007,2008,2009,2010,2011,2012,2013,last three years avg
State,,,,,,,,,,,
Alabama,04000US01,37150,37952,42212,44476,39980,40933,42590,43464,41381,42478.333333
Alaska,04000US02,55891,56418,62993,63989,61604,57848,57431,63648,61137,60738.666667
Arizona,04000US04,45245,46657,62993,46914,45739,46896,48621,47044,50602,48755.666667
Arkansas,04000US05,36658,37057,40795,39586,36538,38587,41302,39018,39919,40079.666667
California,04000US06,51755,55319,55734,57014,56134,54283,53367,57020,57528,55971.666667

In [133]:
a=d.iloc[:,1:11].idxmin()
a

2005                    Arkansas
2006                    Arkansas
2007                    Arkansas
2008                    Arkansas
2009                    Arkansas
2010                    Arkansas
2011                    Arkansas
2012                    Arkansas
2013                    Arkansas
last three years avg    Arkansas
dtype: object